Kaziyev/esp-idf-workspace/apps/i2c_imu/sdkconfig.defaults
# ESP-IDF v5.4.1, ESP32-S3, same UART bridge setup as the original project.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_FREERTOS_HZ=100
# MEKF updates use several local matrices in the app_main task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_QAV250_I2C_SDA_GPIO=40
CONFIG_QAV250_I2C_SCL_GPIO=39
CONFIG_QAV250_MAG_AXES_PHOTO=y
CONFIG_QAV250_OUTPUT_RAW_JSON=y
